
       [ {"fact": "The average person produces enough saliva in their lifetime to fill two swimming pools.", "source": "Source: BBC"},
        {"fact": "Humans have the ability to distinguish between over a trillion different smells.", "source": "Source: Science Daily"},
        {"fact": "The human brain generates about 70,000 thoughts on an average day.", "source": "Source: Forbes"},
        {"fact": "Humans are the only animals known to cry tears of emotion.", "source": "Source: Scientific American"},
        {"fact": "The average person spends about 6 months of their lifetime waiting in line.", "source": "Source: Reader's Digest"},
        {"fact": "Humans have a unique tendon in their wrist called the palmaris longus, but not everyone has it.", "source": "Source: National Geographic"},
        {"fact": "The human eye can detect candlelight from about 1.6 kilometers (1 mile) away on a clear night.", "source": "Source: Guinness World Records"},
        {"fact": "Humans are capable of speaking approximately 5,000 to 7,000 different languages.", "source": "Source: Ethnologue"},
        {"fact": "The average person produces about half a liter of flatulence (gas) per day.", "source": "Source: Live Science"},
        {"fact": "Humans are the only animals that blush due to feelings of embarrassment.", "source": "Source: Psychology Today"},
        {"fact": "The human brain is composed of about 75% water.", "source": "Source: U.S. Geological Survey"},
        {"fact": "Humans have a natural instinct for fairness and will often feel a sense of injustice.", "source": "Source: Scientific American"},
        {"fact": "The human body has enough carbon to make about 9,000 pencils.", "source": "Source: Discover Magazine"},
        {"fact": "Humans have a unique ability to understand and use complex language structures.", "source": "Source: ScienceDirect"},
        {"fact": "The human body produces enough heat in 30 minutes to boil half a gallon of water.", "source": "Source: Discover Magazine"},
        {"fact": "Humans have a limited ability to regrow certain tissues, such as the liver.", "source": "Source: National Geographic"},
        {"fact": "The average person will produce around 37,000 liters of urine in their lifetime.", "source": "Source: The Guardian"},
        {"fact": "Humans have a natural fear of falling, known as basophobia or basiphobia.", "source": "Source: Psychologia"},
        {"fact": "The human body has more bacteria cells than human cells.", "source": "Source: National Institutes of Health"},
        {"fact": "Humans have a specialized tendon in their feet called the plantar fascia, which helps maintain the arches of the foot.", "source": "Source: American Academy of Orthopaedic Surgeons"}
    
       ]